import math
try:
    h_str = input("Введіть висоту дерева:")
    h = float(h_str)
    a_str = input("Введіть к-ть метрів, на яку равлик піднімається за день:")
    a = float(a_str)
    b_str = input("Введіть к-ть метрів, на яку равлик спускається за день:")
    b = float(b_str)

    day = 0

    if a <=0 or b>=a:
       print("Равлик ніколи не підніметься:(")
    elif h<= 0:
        print("Кількість днів, за які равлик підніметься на дерево: 0")
    elif a >= h:
        print("Кількість днів, за які равлик підніметься на дерево: 1")
    else:
        day = h/(a-b)

    print(f"Равлик підніметься на дерево на {math.ceil(day)} день ")
except ValueError:
    print("Будь ласка, вводьте лише числові значення.")
#